[IO_WashingMachineArtefact InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[ItemDefs.ID_ArtifactOfPower MissionItemDefinition]
UseFailureCharacterMessage="you have to %s try this."
ItemName="symbol of strength"
PickupMessage="To understand %s"
UseFailureLevelMessage="You must have at least %d to use this item."
UseFailureConstraintsMessage="You can't use it."
NoManufacturerName="often"

[ItemDefs.ID_ArtifactOfPower:AttributePresentationDefinition_0 AttributePresentationDefinition]
Description="Perfect size for iPhone."
NoConstraintText=""
Suffix=""
Prefix=""

[M_Anemone_fromPart3 MissionDefinition]
MissionName="President"
MissionDescription="Sometimes being a Pirate King means asking your trusted advisors for help. But if there is no other option, it's the option you just found. wayne encourages you to ask around and see if anyone has any helpful advice on being a badass.."
TurnInDescription="Being the King of Thieves sometimes means enlisting the help of your most trusted advisors. After talking to a few people Vaughn realized he had to find out for himself. To help him find himself, you can get a "power item" which is Hyperion's underwear. I should bring it as soon as possible. I don't think it should be kept for long. This seems like a good way to take the first step. But hey, the taste is worth writing about.."
MissionSummary="Find the clues and help Van become the Pirate King.."
MissionGiver="Vaughn"
MissionTurnInLocation="Vaughn"
TeaserText="The van needs help. help the thieves??"

[M_Anemone_VaughnPart3:FindArtefactOfPower MissionObjectiveDefinition]
ProgressMessage="Find Power Tools."

[M_Anemone_VaughnPart3:PayMarcus MissionObjectiveDefinition]
ProgressMessage="Posted by Marcus"

[M_Anemone_VaughnPart3:Set_FindArtefactOfPower MissionObjectiveSetDefinition]
MissionSummaryOverride="Bring back Vaughn's art."
MissionDescriptionOverride="Being a royal thief means that you sometimes act as your own trusted advisor. After being asked many questions, Vaughn knew he had to find it. But before he can do that, he must find the art of his power in the ruins of the sun.."

[M_Anemone_VaughnPart3:Set_PayMarcus MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkBrick MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkClaptrap MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride="Becoming a pirate king means seeking help from trusted advisors. But if you have no other choice, a new one is best, and if all else fails, always ask Claptrap if that's not what you want, Bones asks you.."

[M_Anemone_VaughnPart3:Set_TalkEllie MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkMarcus MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkMoxxi MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkToBrick MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkToEllie MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalktoMarcus MissionObjectiveSetCollectionDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:Set_TalkVaughn MissionObjectiveSetDefinition]
MissionSummaryOverride="return to vaughan."
MissionDescriptionOverride=""

[M_Anemone_VaughnPart3:TalkToBrick MissionObjectiveDefinition]
ProgressMessage="Talk to the brick"

[M_Anemone_VaughnPart3:TalkToClaptrap MissionObjectiveDefinition]
ProgressMessage="clip saying"

[M_Anemone_VaughnPart3:TalkToEllie MissionObjectiveDefinition]
ProgressMessage="Talk to Ellie"

[M_Anemone_VaughnPart3:TalkToMarcus MissionObjectiveDefinition]
ProgressMessage="Marcus's words"

[M_Anemone_VaughnPart3:TalkToMoxxi MissionObjectiveDefinition]
ProgressMessage="Talk to Moxxi"

[M_Anemone_VaughnPart3:TalkToVaughn MissionObjectiveDefinition]
ProgressMessage="Talk to Van"

